[
  {
    "title": "Million Dollar Weekend: The Surprisingly Simple Way to Launch a 7-Figure Business",
    "author": "Noah Kagan with Tahl Raz",
    "date": "Feb 2024",
    "rating": "10",
    "image": "https://m.media-amazon.com/images/I/71I8UaqEYwL._SL1500_.jpg",
    "review": "This book is a must-read for anyone hesitant to start a business or pursue an idea to help others. Noah Kagan shares compelling anecdotes and lessons that highlight how our own doubts are often the biggest obstacle. While the advice to 'just do it' may sound cliché, Kagan presents it in a refreshing and motivating way. More importantly, Kagan lays out step-by-step best practices on being able to quickly validate an idea and begin monetizing it.<br/><br/>Although, Kagan reminds us that success is not a linear path and such an endeavor is accompanied by many hardships. For instance, the common fear of asking but, more specifically, the fear of getting rejected. He challenges the fear of rejection, showing how it's essential for growth. Realizing that a 'no' isn't the end of the world but a required step in the journey that one should embrace. Kagan stresses that if your idea benefits even one person, it has the potential to impact millions, offering powerful motivation to pursue entrepreneurship."
  },
  {
    "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
    "author": "James Clear",
    "date": "Jan 2023",
    "rating": "10",
    "image": "https://m.media-amazon.com/images/I/51SfEPjX9iL._SY445_SX342_.jpg",
    "review": "\"Atomic Habits\" by James Clear has been a transformative journey for me. Clear's insights into habit change have reshaped my approach, making it feel not only attainable but also deeply impactful. His emphasis on small, incremental changes and the importance of systems over goals has fundamentally shifted how I view success.<br/><br/>Reading through the book was a rewarding experience, as Clear's engaging writing style and practical advice made complex ideas accessible. One concept that particularly resonated with me was the \"magic of 1%\", illustrating how even the smallest changes, when consistently applied, can lead to remarkable transformations over time. Overall, \"Atomic Habits\" has provided me with a roadmap for personal growth and continuous improvement, and I've already begun implementing Clear's strategies in various aspects of my life with promising results."
  },
  {
    "title": "The Four: The Hidden DNA of Amazon, Apple, Facebook, and Google",
    "author": "Scott Galloway",
    "date": "Feb 2024",
    "rating": "Pending",
    "image": "https://m.media-amazon.com/images/I/61wt9ICC-3L._SL1500_.jpg",
    "review": "To be read..."
  },
  {
    "title": "Hooked: How to Build Habit-Forming Products",
    "author": "Nir Eyal with Ryan Hoover",
    "date": "Feb 2024",
    "rating": "Pending",
    "image": "https://m.media-amazon.com/images/I/719fyFgdNJL._SL1500_.jpg",
    "review": "To be read..."
  }
]
